# 1. Воспользуемся еще одним встроенным набором данных в R  - ToothGrowth. Данные позволяют исследовать рост зубов у морских свинок в зависимости от дозировки витамина C и типа потребляемых продуктов.
#Сравните среднее значение длины зубов свинок, которые потребляли апельсиновый сок (OJ) с дозировкой 0.5 миллиграмм, со средним значением длины зубов свинок, которые потребляли аскорбиновую кислоту (VC) с дозировкой 2 миллиграмма. Значение t - критерия сохраните в переменную t_stat.

t_stat <- t.test(subset(ToothGrowth$len, ToothGrowth$supp=="OJ" & ToothGrowth$dose==0.5), subset(ToothGrowth$len, ToothGrowth$supp=="VC" & ToothGrowth$dose==2.0))$statistic

# 2. В этом задании нужно проверить гипотезу о равенстве средних двух выборок, загрузив набор данных. В скачанных данных находятся две переменные: количественная переменная, и номинативная переменная с двумя градациями (которая разделяет наблюдения на две группы).
#Сначала с помощью теста Бартлетта проверьте гомогенность дисперсий двух выборок. В случае, если дисперсии значимо не отличаются (с уровнем 0.05), примените тест Стьюдента, иначе - непараметрический тест (Манна-Уитни). 

df <- read.table("dataset_115.txt")
df$V2 <- factor(df$V2)
ifelse(bartlett.test(V1 ~ V2, df)$p.value >= 0.05, 
       t.test(V1 ~ V2, df, var.equal = T)$p.value,
       wilcox.test(V1 ~ V2, df)$p.value)

# 3. В данных сохранены две количественные переменные, проверьте гипотезу о равенстве средних этих переменных при помощи t- теста для независимых выборок.

df <- read.csv("dataset_115.txt", sep = " ", header = FALSE)
ifelse(t.test(df$V1, df$V2)$p.value < 0.05, 
       print(c(mean(df$V1), mean(df$V2), t.test(df$V1, df$V2)$p.value)), 
       print("The difference is not significant"))

