# 1. Напишите функцию, которая выводит номера позиций пропущенных наблюдений в векторе. На вход функция получает числовой вектор с пропущенными значениями. Функция возвращает новый вектор с номерами позиций пропущенных значений.

NA.position <- function(x) {
  which(is.na(x))
}

# 2. Напишите функцию NA.counter для подсчета пропущенных значений в векторе. На вход функция  NA.counter должна принимать один аргумент - числовой вектор. Функция должна возвращать количество пропущенных значений.

NA.counter <- function(x) {
  sum(is.na(x))
}

# 3. Напишите функцию filtered.sum, которая на вход получает вектор с пропущенными, положительными и отрицательными значениями и возвращает сумму положительных элементов вектора.

filtered.sum <- function(x) {
  sum(x[x > 0 & !is.na(x)])
}

# 4. Напишите функцию outliers.rm, которая находит и удаляет выбросы. Для обнаружения выбросов воспользуйтесь графиком Box plot. Выбросами будем считать те наблюдения, которые отклоняются от 1 или 3 квартиля больше чем на 1,5 *  IQR, где  IQR  - межквартильный размах.На вход функция получает числовой вектор x. Функция должна возвращать модифицированный вектор x с удаленными выбросами. 

outliers.rm <- function(x) {
  q <- quantile(x, probs = c(0.25, 0.75))
  iqr <- IQR(x)
  threshold <- 1.5 * iqr
  low <- q[1] - threshold
  high <- q[2] + threshold
  x[x < low | x > high] <- NA
  x[!is.na(x)]
}