# 1. Используем данные mtcars. Сохраните в переменную логистическую регрессионную модель, где в качестве зависимой переменной выступает тип коробки передач (am), в качестве предикторов переменные disp, vs, mpg. Значения коэффициентов регрессии сохраните в переменную log_coef.

# загрузка данных mtcars
data(mtcars)

# построение модели
model <- glm(am ~ disp + vs + mpg, data = mtcars, family = "binomial")

# вывод коэффициентов регрессии
log_coef <- coef(model)

# 2. Изобразите различия длины зубов морских свинок в различных условиях дозировки и типа потребляемого продукта.
#По оси x - переменная supp.
#По оси y - переменная len.
#Цвет ящиков с усами (boxplot) - переменная dose.

library(ggplot2)

obj <- ggplot(ToothGrowth, aes(x = supp, y = len, fill = dose, order = c("OJ", "VC"))) +
  geom_boxplot()