# 1. C помощью функции step найдите оптимальную модель для предсказания rating в датасете attitude. Model_full и model_null уже созданы. Сохраните команду с функцией step в переменную ideal_model. 

# задаем начальную модель
model_start <- lm(rating ~ 1, data = attitude)

# задаем границы поиска моделей
scope <- list(lower = model_null, upper = model_full)

# ищем оптимальную модель
ideal_model <- step(object = model_start, 
                    scope = scope, 
                    direction = "both")

# 2. В этой задаче будем работать со встроенным датасетом LifeCycleSavings. Попытаемся предсказать значение sr на основе всех остальных переменных в этом датасете. Вспомните способы сокращения формул и напишите команду, которая создаёт линейную регрессию с главными эффектами и всеми возможными взаимодействиями второго уровня. Сохраните модель в переменную model.

model <- lm(sr ~ .^2, data = LifeCycleSavings)