# 1. Напишите функцию fill_na, которая принимает на вход данные с тремя переменными:  x_1  -  числовой вектор, x_2 - числовой вектор, y - числовой вектор с пропущенными значениями.
#На первом этапе, используя только наблюдения, в которых нет пропущенных значений, мы построим регрессионную модель (без взаимодействий), где  y — зависимая переменная, x_1 и x_2 — независимые переменные. Затем, используя построенную модель, мы заполним пропущенные значения предсказаниями модели.
#Функция должна возвращать dataframe c новой переменной  y_full. Сохраните в нее переменную y, в которой пропущенные значения заполнены предсказанными значениями построенной модели.

fill_na <- function(x){
  model <- lm(y ~ x_1 + x_2, data = na.omit(x))
  x$y_full <- ifelse(is.na(x$y), predict(model, newdata = x), x$y)
  return(x)
}

# 2. В переменной df сохранен subset данных mtcars только с переменными "wt", "mpg", "disp", "drat", "hp". Воспользуйтесь множественным регрессионным анализом, чтобы предсказать вес машины (переменная "wt"). Выберите такую комбинацию независимых переменных (из "mpg", "disp", "drat", "hp"), чтобы значение R^2 adjusted было наибольшим. Взаимодействия факторов учитывать не надо. 

model <- lm(wt ~ mpg + disp + hp, data = df)

# 3. Визуализируйте взаимодействие переменных wt и am, дополнив код, приведённый в задании:
#Ось x - переменная wt
#Ось y - переменная mpg
#Цвет регрессионных прямых - переменная am

library(ggplot2)
# сначала переведем переменную am в фактор
mtcars$am <- factor(mtcars$am)

# теперь строим график
my_plot <- ggplot(mtcars, aes(x = wt, y = mpg, color = am)) + 
  geom_smooth(method = "lm", formula = y ~ x, se = FALSE)